# 7.1===================================================================
# ----------------------------------------------------------------------
message = input("Tell me something, and I will repeat it back to you: ")
print(message)
# 7.1.1=================================================================
# ----------------------------------------------------------------------
name = input("Please enter your name: ")
print("Hello, " + name + "!")
# ----------------------------------------------------------------------
prompt = "If you tell us who you are, we can personalize the messages you see."
prompt += "\nWhat is your first name? " # 提示太長，超過一行 -> 把提示儲存在變數裡面

name = input(prompt)
print("\nHello, " + name + "!")
# 7.1.2=================================================================
# ----------------------------------------------------------------------
age = input("How old are you? ") # input()輸入後會是字串，即使是數字也一樣
age # 會是'數字' -> 字串的內容是數字
# ----------------------------------------------------------------------
age = input("How old are you? ") # input()輸入後會是字串，即使是數字也一樣
age >= 18  # 拿字串跟數字比較的話會報錯，可以用int()強制型轉來解決這個問題
# ----------------------------------------------------------------------
age = input("How old are you? ") # input()輸入後會是字串，即使是數字也一樣
age = int(age)
age >= 18 # 印出True
# ----------------------------------------------------------------------
height = input("How tall are you, in inches? ")
height = int(height) # 在這裡強制型轉，為了後面進行判斷(跟整數int比較)

if height >= 36:
    print("\nYou're tall enough to ride!")
else:
    print("\nYou'll be able to ride when you're a little older.")
# 7.1.3=================================================================
# ----------------------------------------------------------------------
















































































